# Задача 2. Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Например:
#     - [2, 3, 4, 5, 6] => [12, 15, 16];
#     - [2, 3, 5, 6] => [12, 15]

lst = [2, 3, 5, 6]
prod = 1
for i in range((len(lst)+1)//2):
    prod = lst[i] * lst[- 1- i]
    print(prod, end=' ')